app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ?  [["user_id", 3]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ?  [["user_id", 2]]
INSERT INTO "expenses" ("comment", "expense_time", "created_at", "updated_at", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", ""], ["expense_time", "2020-12-26 00:00:00"], ["created_at", "2020-12-26 20:42:27.725599"], ["updated_at", "2020-12-26 20:42:27.725599"], ["user_id", 2], ["category_id", 3]]
---
  def index
    require 'csv'
    #@expenses = Expense.all
    @expenses = Expense.where(user_id: current_user.id)
    respond_to do |format|
      format.html
      format.csv do
        vals = CSV.generate do |csv|
          csv  << ["Category","Amount","Date"]
          @expenses.each do |expense|
            csv << [expense.category.category_name,expense.amount,expense.expense_time.to_date]

INSERT INTO "expenses" ("amount", "comment", "expense_time", "created_at", "updated_at", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
   # @expense = Expense.new(**expense_params, user_id: current_user.id, category_id: Category.find_by_category_name)
    @expense = Expense.new(**expense_params, user_id: current_user.id)

    respond_to do |format|
      if @expense.save

UPDATE "expenses" SET "amount" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["amount", 123.55], ["updated_at", "2020-12-27 18:36:16.115072"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @expense.update(expense_params)

DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 7]]
---
  def destroy
    @expense.destroy

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_expense
      @expense = Expense.find(params[:id])