app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
---
  def index
    #@posts = Post.all
    @posts = Post.where(user_id: current_user.id)

INSERT INTO "posts" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "bumba1"], ["text", "bumna2"], ["created_at", "2020-12-26 10:31:35.099190"], ["updated_at", "2020-12-26 10:31:35.099190"], ["user_id", 2]]
---
  def create
    @post = Post.new(**post_params, user_id: current_user.id)

    respond_to do |format|
      if @post.save