app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "6"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(username: params[:login])