app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "lol"], ["password_digest", "$2a$12$5Zu4Txn9tMlHTeuQ2OpviOcXwnbA4MdI2qzCynaw03p/2hPTRYsZW"], ["created_at", "2020-12-23 21:09:17.723502"], ["updated_at", "2020-12-23 21:09:17.723502"]]