app/views/expenses/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label t(:category) %>
    <%= form.collection_select :category_id, Category.all, :id, :category_name, {}, class: "form-control" %>